In [1]:
import numpy as np
import pandas as pd

In [3]:
# A Series is a one dimensional DataFrame 
data = np.array ([85, 90, 70, 80])
series = pd.Series(data=data, name="marks")

print(series)

0    85
1    90
2    70
3    80
Name: marks, dtype: int64

In [4]:
# This is a Series with a one-dimesnional data values and Index
data = np.array([[25, 85],
                 [25, 90],
                 [26, 70],
                 [24, 80]])
dataframe = pd.DataFrame(data=data, columns=["age", "marks"])
print(dataframe)

   age  marks
0   25     85
1   25     90
2   26     70
3   24     80

# Method 1: Selecting a single column using the column name

In [5]:
# Load some data
import pandas as pd
from sklearn.datasets import load_wine
wine = load_wine()
df = pd.DataFrame(data=wine.data,
                  columns=wine.feature_names)
# Select the 'alcohol column'
print(df['alcohol'])
print(type(df['alcohol']))

0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 178, dtype: float64
<class 'pandas.core.series.Series'>

# Method 2: Selecting multiple columns using the column names

In [6]:
df[['alcohol', 'ash', 'hue']]

     alcohol   ash   hue
0      14.23  2.43  1.04
1      13.20  2.14  1.05
2      13.16  2.67  1.03
3      14.37  2.50  0.86
4      13.24  2.87  1.04
..       ...   ...   ...
173    13.71  2.45  0.64
174    13.40  2.48  0.70
175    13.27  2.26  0.59
176    13.17  2.37  0.60
177    14.13  2.74  0.61

[178 rows x 3 columns]

# Method 3: Selecting a single column using the .loc attribute

In [8]:
df.loc[:, 'alcohol']

0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 178, dtype: float64

# Method 4: Selecting multiple columns using the .loc attribute

In [9]:
df.loc[:, ['alcohol', 'ash', 'hue']]

     alcohol   ash   hue
0      14.23  2.43  1.04
1      13.20  2.14  1.05
2      13.16  2.67  1.03
3      14.37  2.50  0.86
4      13.24  2.87  1.04
..       ...   ...   ...
173    13.71  2.45  0.64
174    13.40  2.48  0.70
175    13.27  2.26  0.59
176    13.17  2.37  0.60
177    14.13  2.74  0.61

[178 rows x 3 columns]

In [11]:
# If there are multiple labels, they should be specified inside lists:

df.loc[['row_1', 'row_2'], 
       ['column_1', 'column_2']]

# Method 5: Selecting a single column using the .iloc attribute

In [12]:
df.iloc[:, 0]

0      14.23
1      13.20
2      13.16
3      14.37
4      13.24
       ...
173    13.71
174    13.40
175    13.27
176    13.17
177    14.13
Name: alcohol, Length: 178, dtype: float64

# Method 6: Selecting multiple columns using the .iloc attribute

In [13]:
df.iloc[:, [0, 2, 10]]

     alcohol   ash   hue
0      14.23  2.43  1.04
1      13.20  2.14  1.05
2      13.16  2.67  1.03
3      14.37  2.50  0.86
4      13.24  2.87  1.04
..       ...   ...   ...
173    13.71  2.45  0.64
174    13.40  2.48  0.70
175    13.27  2.26  0.59
176    13.17  2.37  0.60
177    14.13  2.74  0.61

[178 rows x 3 columns]

In [ ]:
# If there are multiple labels, they should be specified inside lists:

df.iloc[['row_index_1', 'row_index_2'], 
       ['column_index_1', 'column_index_2']]

# Method 7: Selecting consecutive columns using the .iloc attribute (The easy way)

In [14]:
df.iloc[:, [0, 1, 2, 3, 4]]

     alcohol  malic_acid   ash  alcalinity_of_ash  magnesium
0      14.23        1.71  2.43               15.6      127.0
1      13.20        1.78  2.14               11.2      100.0
2      13.16        2.36  2.67               18.6      101.0
3      14.37        1.95  2.50               16.8      113.0
4      13.24        2.59  2.87               21.0      118.0
..       ...         ...   ...                ...        ...
173    13.71        5.65  2.45               20.5       95.0
174    13.40        3.91  2.48               23.0      102.0
175    13.27        4.28  2.26               20.0      120.0
176    13.17        2.59  2.37               20.0      120.0
177    14.13        4.10  2.74               24.5       96.0

[178 rows x 5 columns]

In [15]:
# We can also use the following easy method to obtain the same result.

df.iloc[:, 0:5]

     alcohol  malic_acid   ash  alcalinity_of_ash  magnesium
0      14.23        1.71  2.43               15.6      127.0
1      13.20        1.78  2.14               11.2      100.0
2      13.16        2.36  2.67               18.6      101.0
3      14.37        1.95  2.50               16.8      113.0
4      13.24        2.59  2.87               21.0      118.0
..       ...         ...   ...                ...        ...
173    13.71        5.65  2.45               20.5       95.0
174    13.40        3.91  2.48               23.0      102.0
175    13.27        4.28  2.26               20.0      120.0
176    13.17        2.59  2.37               20.0      120.0
177    14.13        4.10  2.74               24.5       96.0

[178 rows x 5 columns]

# Method 8: Selecting the last column

In [16]:
# We can count the number of columns in the data frame using the .shape attribute 

df.shape

(178, 13)

In [17]:
# the last columns is the 13th one that can be accessed through index 12. By using .iloc

df.iloc[:, 12]

0      1065.0
1      1050.0
2      1185.0
3      1480.0
4       735.0
        ...
173     740.0
174     750.0
175     835.0
176     840.0
177     560.0
Name: proline, Length: 178, dtype: float64

In [19]:
# The second method is much easy. Here, we do not need to know the number of columns in the data frame.

df.iloc[:, -1]

0      1065.0
1      1050.0
2      1185.0
3      1480.0
4       735.0
        ...
173     740.0
174     750.0
175     835.0
176     840.0
177     560.0
Name: proline, Length: 178, dtype: float64